_posts/technology/2022-10-18-cppcoreguidelines-c49.html
---
layout: post
title: CppCoreGuidelines C.49 在构造函数中进行初始化操作，不要进行赋值操作
categories: [technology]
tags: [CppCoreGuidelines]
---

<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
&ldquo;Prefer initialization to assignment in constructors&rdquo;
</p>

<p>
理由
</p>

<p>
所谓初始化，就是要进行初始化，而不是赋值。初始化操作更优雅，效率更高。可以防止设置之前使用（use before set）之类的错误。
</p>

<p>
好例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">A</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">Good</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s1</span>;
  <span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">A</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">czstring</span> <span style="color: #000000;">p</span><span style="color: #7388d6;">)</span> : s1<span style="color: #7388d6;">{</span>p<span style="color: #7388d6;">}</span> <span style="color: #7388d6;">{</span> <span style="color: #7388d6;">}</span>    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">GOOD: directly construct (and the C-string is explicitly named)</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>

<p>
坏例子
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">B</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">BAD</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s1</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">B</span><span style="color: #7388d6;">(</span><span style="color: #7F0055; font-weight: bold;">const</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">char</span>* <span style="color: #000000;">p</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">{</span> s1 = p; <span style="color: #7388d6;">}</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">BAD: default constructor followed by assignment</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>;

<span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">C</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">UGLY, aka very bad</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span>* <span style="color: #000000;">p</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">C</span><span style="color: #7388d6;">()</span> <span style="color: #7388d6;">{</span> cout &lt;&lt; *p; p = <span style="color: #7F0055; font-weight: bold;">new</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">int</span><span style="color: #909183;">{</span>10<span style="color: #909183;">}</span>; <span style="color: #7388d6;">}</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">accidental use before initialized</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>

<p>
更好地例子
</p>

<p>
这里我们不用 <code>const char* s</code> 我们用 C++17 中的 <code>std::string_view</code> 或
<code>gsl::span&lt;char&gt;</code> 做函数的参数：
</p>

<div class="org-src-container">
<pre class="src src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">D</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">Good</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">string</span> <span style="color: #000000;">s1</span>;
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">D</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">string_view</span> <span style="color: #000000;">v</span><span style="color: #7388d6;">)</span> : s1<span style="color: #7388d6;">{</span>v<span style="color: #7388d6;">}</span> <span style="color: #7388d6;">{</span> <span style="color: #7388d6;">}</span>    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">GOOD: directly construct</span>
    <span style="color: #3F7F5F;">// </span><span style="color: #3F7F5F;">...</span>
<span style="color: #707183;">}</span>;
</pre>
</div>
